# WallSweep Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweep Class
Members See Also
---
Represents a wall sweep or reveal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class WallSweep : HostObject
```

Visual Basic
---
```text
Public Class WallSweep _
	Inherits HostObject
```

Visual C++
---
```text
public ref class WallSweep : public HostObject
```

# Remarks
This element may represent either a standalone sweep or reveal element created by the Revit user interface or API, or a "fixed" wall sweep or reveal that was created by the contents of a wall's compound structure.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..WallSweep
# See Also
WallSweep Members
Autodesk.Revit.DB Namespace